artilleryTest.yml
config:
  target: 'http://localhost:3002'
  http:
    pool: 10
  phases:
    - duration: 60
      arrivalRate: 1
scenarios:
  - name: 'Get author'
    flow:
      - loop:
        - get:
            url: '/{{ $randomNumber(9000000, 10000000) }}/'
        count: 1000
  - name: "Create new author"
    flow:
      - loop:
        - post:
            url: "/create"
        count: 1000